# Pandas

In [ ]:
pandas is using numpy data structure in backened
it is also efficient like numpy
It is a group of Data Frame

In [1]:
import pandas as pd

In [3]:
#Series is a single one_dimensional array
a = pd.Series([1, 2, 3, 4])
a

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
a.values

array([1, 2, 3, 4], dtype=int64)

In [8]:
a.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
b = pd.Series([1, 2, 3, 4], index = ['a', 'b', 'c', 'd'])
b

a    1
b    2
c    3
d    4
dtype: int64

In [10]:
# How to access values in pandas series
a[0]

1

In [12]:
# Changing value in pandas series
a[0] = 10
a

0    10
1     2
2     3
3     4
dtype: int64

In [13]:
# Getting multiple values from pandas series
a[[0, 1, 3]]

0    10
1     2
3     4
dtype: int64

In [14]:
# Applying Slicing on Pandas Series
a[1:3]

1    2
2    3
dtype: int64

In [15]:
khi_temps = pd.Series([35, 30, 40, 50, 42, 44, 47])
khi_temps

0    35
1    30
2    40
3    50
4    42
5    44
6    47
dtype: int64

In [16]:
# Getting Boolean array
khi_temps > 35

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [17]:
# Getting values greater than 35
khi_temps[khi_temps > 35]

2    40
3    50
4    42
5    44
6    47
dtype: int64

In [18]:
# Arithmetic operations
a ** 2

0    100
1      4
2      9
3     16
dtype: int64

In [21]:
khi_temp_dict = {"10:00":35 ,"10:30":34 ,"11:00":36 ,"12:00":37}

In [23]:
khi_t = pd.Series(khi_temp_dict)
khi_t

10:00    35
10:30    34
11:00    36
12:00    37
dtype: int64

In [30]:
c = pd.Series(khi_temp_dict, index =['10:00', '11:00', '12:00', '13:00', '14:00'])
c

10:00    35.0
10:30    34.0
11:00    36.0
12:00    37.0
13:00     NaN
14:00     NaN
dtype: float64

In [29]:
c.isnull()

10:00    False
11:00    False
12:00    False
13:00     True
14:00     True
dtype: bool

In [35]:
lhr_temp_dict = {"10:00":35 ,"10:30":34 ,"11:00":36 ,"12:00":37}

In [36]:
lhr_t = pd.Series(lhr_temp_dict)

In [38]:
c + lhr_t

10:00    70.0
10:30    68.0
11:00    72.0
12:00    74.0
13:00     NaN
14:00     NaN
dtype: float64

In [39]:
khi_t.name = "Karachi temperature"

In [41]:
khi_t

10:00    35
10:30    34
11:00    36
12:00    37
Name: Karachi temperature, dtype: int64

In [44]:
# DATAFRAME use to store multiple attributes
students = pd.DataFrame([{'name': "Ali", 'age': 15}, {'name': "Nabeel", 'age': 20},{'name': "Salman", 'age': 25}])

In [45]:
students

   age    name
0   15     Ali
1   20  Nabeel
2   25  Salman

In [50]:
data = pd.DataFrame({'state': ['Ohio', 'Oman', 'Australia'], 'population': [35, 56, 66]})
data

       state  population
0       Ohio          35
1       Oman          56
2  Australia          66

In [52]:
data1 = pd.DataFrame({'state': ['Ohio', 'Oman', 'Australia', 'America', 'Pakistan', 'Dubai'], 'population': [35, 56, 66, 80, 85, 86]})
data1

       state  population
0       Ohio          35
1       Oman          56
2  Australia          66
3    America          80
4   Pakistan          85
5      Dubai          86

In [53]:
data1.head()

       state  population
0       Ohio          35
1       Oman          56
2  Australia          66
3    America          80
4   Pakistan          85

In [54]:
data1.tail()

       state  population
1       Oman          56
2  Australia          66
3    America          80
4   Pakistan          85
5      Dubai          86

In [55]:
data1.columns

Index(['state', 'population'], dtype='object')

In [56]:
data1['population']

0    35
1    56
2    66
3    80
4    85
5    86
Name: population, dtype: int64

In [57]:
data1.state

0         Ohio
1         Oman
2    Australia
3      America
4     Pakistan
5        Dubai
Name: state, dtype: object

In [58]:
import numpy as np

In [60]:
np.mean(data1.population)

68.0

Getting values in rows
loc will return full row

In [63]:
data1.loc[0]

state         Ohio
population      35
Name: 0, dtype: object

In [64]:
data1.loc[[0, 2]]

       state  population
0       Ohio          35
2  Australia          66

In [65]:
data1.loc[1:3]

       state  population
1       Oman          56
2  Australia          66
3    America          80

In [69]:
d = pd.Series([1, 4, 5])
d

0    1
1    4
2    5
dtype: int64

In [70]:
data1['dept'] = d

In [71]:
data1

       state  population  dept
0       Ohio          35   1.0
1       Oman          56   4.0
2  Australia          66   5.0
3    America          80   NaN
4   Pakistan          85   NaN
5      Dubai          86   NaN

In [74]:
data1['date'] = 16.5
data1

       state  population  dept  date
0       Ohio          35   1.0  16.5
1       Oman          56   4.0  16.5
2  Australia          66   5.0  16.5
3    America          80   NaN  16.5
4   Pakistan          85   NaN  16.5
5      Dubai          86   NaN  16.5

In [75]:
data1['income'] = 10.5
data1

       state  population  dept  date  income
0       Ohio          35   1.0  16.5    10.5
1       Oman          56   4.0  16.5    10.5
2  Australia          66   5.0  16.5    10.5
3    America          80   NaN  16.5    10.5
4   Pakistan          85   NaN  16.5    10.5
5      Dubai          86   NaN  16.5    10.5

In [76]:
data1.income = 111
data1

       state  population  dept  date  income
0       Ohio          35   1.0  16.5     111
1       Oman          56   4.0  16.5     111
2  Australia          66   5.0  16.5     111
3    America          80   NaN  16.5     111
4   Pakistan          85   NaN  16.5     111
5      Dubai          86   NaN  16.5     111

In [77]:
data1['mastrern'] = data1.state == "Ohio"
data1

       state  population  dept  date  income  mastrern
0       Ohio          35   1.0  16.5     111      True
1       Oman          56   4.0  16.5     111     False
2  Australia          66   5.0  16.5     111     False
3    America          80   NaN  16.5     111     False
4   Pakistan          85   NaN  16.5     111     False
5      Dubai          86   NaN  16.5     111     False

In [80]:
# TO Delete column
del data1['mastrern']

In [81]:
data1

       state  population  dept  date  income
0       Ohio          35   1.0  16.5     111
1       Oman          56   4.0  16.5     111
2  Australia          66   5.0  16.5     111
3    America          80   NaN  16.5     111
4   Pakistan          85   NaN  16.5     111
5      Dubai          86   NaN  16.5     111

In [82]:
pop = {"nevada": {2002: 2.4, 2005: 2.9},
       "Ohio": {2002: 1.5, 2004: 1.9}
      }

In [83]:
data2 = pd.DataFrame(pop)
data2

      nevada  Ohio
2002     2.4   1.5
2004     NaN   1.9
2005     2.9   NaN

In [85]:
data1.transpose()

               0     1          2        3         4      5
state       Ohio  Oman  Australia  America  Pakistan  Dubai
population    35    56         66       80        85     86
dept           1     4          5      NaN       NaN    NaN
date        16.5  16.5       16.5     16.5      16.5   16.5
income       111   111        111      111       111    111

In [87]:
data2.index

Int64Index([2002, 2004, 2005], dtype='int64')

In [88]:
data2.values

array([[2.4, 1.5],
       [nan, 1.9],
       [2.9, nan]])

In [89]:
distance = (10, 20, 30, 40)
distance

(10, 20, 30, 40)

In [91]:
obj = pd.Series(range(3), index = ['a', 'b', 'c'])
obj

a    0
b    1
c    2
dtype: int64

In [92]:
obj.index = ['k', 'l', 'j']
obj

k    0
l    1
j    2
dtype: int64

In [93]:
obj1 = pd.Series(['blue', 'red', 'orange'])
obj1.reindex = range(6)
obj1

0      blue
1       red
2    orange
dtype: object

In [99]:
# deleting row
obj.drop('k')

l    1
j    2
dtype: int64

In [100]:
data1.loc[[2,3], ['date', 'income']]

   date  income
2  16.5     111
3  16.5     111

In [101]:
data1.iloc[0]

state         Ohio
population      35
dept             1
date          16.5
income         111
Name: 0, dtype: object